no_contact_or_file = 'Телефонная книга пуста или не открыта'

load_successful = 'Телефонная книга удачно загружена!'
save_successful = 'Телефонная книга успешно сохранена.'

new_contact_successful = 'Контакт успешно создан!'

new_name = 'Введите имя и фамилию контакта: '
new_phone = 'Введите телефон контакта: '
new_comment = 'Введите комментарий контакта: '

search_contact = 'Введите данные по искомому контакту: '
res_search = 'Результат поиска: '
no_data_search = 'Таких данных нет в справочнике!'

num_contact = 'Введите номер контакта, который хотите изменить: '
edit_text = 'На какой текст изменить: '
no_contact = 'Выбранного контакта не существует!'
add_change_cont = 'Контакт был изменен. Ура, товарищи! '

deleted_cont = 'Введите номер контакта для удаления: '
cont_was_del = 'Контакт был удален!'

is_changed = 'Были внесены изменения. Сохранить?'

bye_bye = 'Пока Пока'
